
/*********************************************************************************************************
	Copyright (C), 2009-2014, ZenoIntel Tech. Co., Ltd.
	时间:2014/08/11
	描述:
		获取产品配置文件的值

**********************************************************************************************************/


#ifndef __PRODUCT_DEFINE_H__
#define __PRODUCT_DEFINE_H__


#ifdef __cplusplus
extern "C" {
#endif


/*
**	============================================================================================
**	函数说明: 获取产品配置文件的值
**	函数返回: 配置的字符串，如果没配置，返回""
**	参数列表: key:配置项的名称，层次关系用"."表示。
**  例如:string cpu = GetProductDefine("Hardware.CPU");获取CPU型号
**	============================================================================================
*/
const char* GetProductDefine(const char* key, const char* defvalue);


/*
**	============================================================================================
**	函数说明: 获取产品配置文件的值
**	函数返回: 获取配置数值，如果没配置，返回0
**	参数列表: 同上
**            
**	============================================================================================
*/
int GetProductDefineInt(const char* key, int defvalue);




#ifdef __cplusplus
}
#endif

#endif

