/* 
 * mdk_cipher.h -- cipher模块对外提供的API头文件
 *
 * Created by : Chipup Software Team
 * Copyright : (C) 2021-2022 ZheJiang Xinsheng Electronic Technology Co., Ltd. All rights reserved.
 */




/* ========================================================================== */
/*                             头文件区                                       */
/* ========================================================================== */


/* ========================================================================== */
/*                           宏和类型定义区                                   */
/* ========================================================================== */


/* ========================================================================== */
/*                          数据结构定义区                                    */
/* ========================================================================== */


/* ========================================================================== */
/*                          函数声明区                                        */
/* ========================================================================== */


#ifndef __MDK_CIPHER_H__
#define __MDK_CIPHER_H__

#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
#include "ni_type.h"
#include "ni_comm_cipher.h"

/*******************************************************************************
* 函数名  : NI_MDK_CIPHER_EncryptMem
* 描  述  : 配置参数，进行mem加密
* 输  入  : 
* 输  出  : 无
* 返回值  : NI_SUCCESS  : 成功 
*           NI_FAILURE  : 失败
*******************************************************************************/
NI_S32 NI_MDK_CIPHER_EncryptMem(CIPHER_MEM_S *pstCipherMem);

/*******************************************************************************
* 函数名  : NI_MDK_CIPHER_EncryptReg
* 描  述  : 配置参数，进行reg加密
* 输  入  : 
* 输  出  : 无
* 返回值  : NI_SUCCESS  : 成功 
*           NI_FAILURE  : 失败
*******************************************************************************/
NI_S32 NI_MDK_CIPHER_EncryptReg(CIPHER_REG_S *pstCipherReg);


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */

#endif /* End of #ifndef __MDK_CIPHER_H__ */

